export const PLANTS_PER_PAGE = 9;

export const DIFFICULTY_MAP = {
    easy: { text: 'Легкий', class: 'badge-easy' },
    medium: { text: 'Средний', class: 'badge-medium' },
    hard: { text: 'Сложный', class: 'badge-hard' }
};

export const TYPE_DISPLAY_NAMES = {
    'decorative': 'Декоративнолистные',
    'succulent': 'Суккуленты',
    'flowering': 'Цветущие',
    'liana': 'Лианы',
    'fern': 'Папоротники',
    'ampel': 'Ампельные',
    'palm': 'Пальмы и древовидные',
    'декоративнолистные': 'Декоративнолистные',
    'суккулент': 'Суккуленты',
    'суккуленты': 'Суккуленты',
    'цветущее': 'Цветущие',
    'цветущие': 'Цветущие',
    'лианы': 'Лианы',
    'лиана': 'Лианы',
    'папоротник': 'Папоротники',
    'папоротники': 'Папоротники',
    'ампельные': 'Ампельные',
    'ампельное': 'Ампельные',
    'пальмы': 'Пальмы и древовидные',
    'древовидные': 'Пальмы и древовидные',
    'пальма': 'Пальмы и древовидные'
};